dataset_gen/CE_datasets/FPO_cylinder/Multiple_Hole/Design_Point_0/0/U
FoamFile
{
    version 2.0;
    format ascii;
    class volVectorField;
    object U;
}

dimensions      [0 1 -1 0 0 0 0];
internalField   uniform (0 0 0);
boundaryField
{
    left
    {
        type            codedFixedValue;
        value           uniform (0 0 0);
        name            parabolicinlet;
        code
        #{
            // Channel height
            const scalar H = 64.0;
            // Maximum velocity to get Re=100 if nu=0.01 and L=1 (Re=Umax*L/nu)
            const scalar Umax = 1.0;
            // Get patch cell center positions (only need the y-coordinate)
            const vectorField& pos = patch().Cf();
            vectorField Uvec(pos.size());
            forAll(pos, i)
            {
                scalar y = pos[i].y();
                // Parabolic profile: zero at y=0 and y=H, max at y=H/2.
                scalar u = 4.0 * Umax * y * (H - y) / (H * H);
                Uvec[i] = vector(u, 0.0, 0.0);
            }
            operator==(Uvec);
        #};
    }
    right
    {
        type            zeroGradient;
    }
    bottom
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    top
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    frontAndBack
    {
        type            empty;
    }
}
